---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.CoordinateSystem
source: html/9397e93e-b63f-ec7d-fa28-7a0befb68966.htm
---
# Autodesk.Revit.DB.ConnectorElement.CoordinateSystem Property

The coordinate system of the connector.

## Syntax (C#)
```csharp
public virtual Transform CoordinateSystem { get; }
```

## Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.